package basicsJava.classesAndObjects.whyAreClassesNeeded.task1;

public class Converter {
}
/*
Условие задачи:
Пришло время добавить класс в финансовое приложение. Сейчас весь код описан в одном классе Praktikum:
и конвертация валют, и работа с тратами, и взаимодействие с пользователем.
В таком коде становится сложно ориентироваться. Вы уже разбили его на методы,
c помощью классов можно сделать его ещё проще. Опишите класс Converter.
В нём будет храниться вся логика, связанная с конвертацией валют.
 */