package JavaCore2.module2.sprint5.theme04.task0401;

public class Practicum {
    public static void main(String[] args) {
        new KeywordsGame().runGame();
    }
}
/*
Новичок-программист написал игру, которая проверяет знание ключевых и зарезервированных слов,
но, кажется, сам немного в них запутался. Помогите сделать так, чтобы игра работала правильно.

Уберите использование ключевых слов в качестве названий классов и переменных.
Проверьте, на своём ли месте стоят некоторые ключевые слова.
Убедитесь в том, что ключевые слова не использованы в качестве идентификаторов.
Проверьте написание ключевых слов — не нарушено ли правило регистра.

Комментарии для тестирования
Имя класса может быть любым валидным идентификатором, как и имя переменной.
 */
