package JavaCore1.module1.sptint1.theme05.task0506;

public class Praktikum {
    public static void main(String[] args) {
        // System.out.println(stateHolidays)
    }
}
/*
Напишите код хеш-таблицы государственных праздников stateHolidays,
которая будет содержать месяцы и праздничные даты:
Январь — 1, 7;
Февраль — 23;
Март — 8;
Май — 1, 9;
Июнь — 12;
Ноябрь — 4.

Импортируйте классы HashMap и ArrayList.
Ключи хеш-таблицы stateHolidays должны быть строкового типа — String,
а значения — списки из целых чисел ArrayList<Integer>.
Создайте для каждого месяца свой список: january, february, march, may, june, november.
Добавьте в списки элементы с помощью метода add().
Добавьте элементы в хеш-таблицу с помощью метода put().
 */
