package JavaCore2.module2.sprint5.theme01.task0101.task01;

public class CleanInput {
    public String fixString(String str) {

    }
}
/*
Пользователи веб-сайта часто вставляют лишние пробелы в поля ввода.
Напишите метод fixString() для обрезки ненужных пробелов.
Он должен возвращать текст "Вы ничего не ввели!", если входная строка
пустая или состоит из пробельных символов или строку без начальных и конечных пробелов.

Для того чтобы проверить, пустая строка или нет, нужен метод isBlank().
Отчистить строку от лишних пробелов в начале и конце можно с помощью trim().
Для оформления метода вам понадобится условная конструкция if () {} else {}.
* */